## Exploring Airbnb Market Trends
Apply your importing and cleaning data and data manipulation skills to explore New York City Airbnb data.

#### Project Description
New York City has a variety of Airbnb listings to meet the high demand for temporary lodging for travelers, with several different price levels, room types, and locations.
Practice your skills in importing and cleaning data and data manipulation and report insights to a real estate start-up!

In [1]:
# Import necessary packages
import pandas as pd
import numpy as np

### Cleaning Price data

In [2]:
df = pd.read_csv('airbnb_price.csv')
df.head()

   index  listing_id        price                nbhood_full
0      0        2595  225 dollars         Manhattan, Midtown
1      1        3831   89 dollars     Brooklyn, Clinton Hill
2      2        5099  200 dollars     Manhattan, Murray Hill
3      3        5178   79 dollars  Manhattan, Hell's Kitchen
4      4        5238  150 dollars       Manhattan, Chinatown

In [3]:
price = df.drop('index', axis=1)

### Cleaning room_type data

In [4]:
df2 = pd.read_excel('airbnb_room_type.xlsx')
df2.head()

,index,listing_id,description,room_type
0,0,2595,Skylit Midtown Castle,Entire home/apt
1,1,3831,Cozy Entire Floor of Brownstone,Entire home/apt
2,2,5099,Large Cozy 1 BR Apartment In Midtown East,Entire home/apt
3,3,5178,Large Furnished Room Near B'way,private room
4,4,5238,Cute & Cozy Lower East Side 1 bdrm,Entire home/apt

In [5]:
room_type = df2.drop('index', axis=1)

### Cleaning last review data

In [6]:
df3 = pd.read_csv('airbnb_last_review.tsv')
df3.head()

   index  listing_id    host_name   last_review
0      0        2595     Jennifer   May 21 2019
1      1        3831  LisaRoxanne  July 05 2019
2      2        5099        Chris  June 22 2019
3      3        5178     Shunichi  June 24 2019
4      4        5238          Ben  June 09 2019

In [7]:
last_review = df3.drop('index', axis=1)

### Merging the dataframes

In [8]:
merged_df = pd.merge(price, room_type, on='listing_id')
merged_all = pd.merge(merged_df, last_review, on='listing_id')

### Changing the dtype of last_review to pd.to_datetime and Findig the earliest and most recent reviews

In [9]:
# What are the dates of the earliest and most recent reviews?
# To use a function like max()/min() on last_review date column, it needs to be converted to datetime type
merged_all['last_review_date'] = pd.to_datetime(merged_all['last_review'], format='%B %d %Y')

first_reviewed = merged_all['last_review_date'].min()
last_reviewed = merged_all['last_review_date'].max()

print('The earliest review was:',first_reviewed, '\n')
print('The most recent review was:',last_reviewed)

The earliest review was: 2019-01-01 00:00:00

The most recent review was: 2019-07-09 00:00:00

### Finding the private_rooms

In [10]:
# How many of the listings are private rooms?
# Since there are differences in capitalization, make capitalization consistent
merged_all['room_type'] = merged_all['room_type'].str.lower()
private_room_count = merged_all[merged_all['room_type'] == 'private room'].shape[0]
print('The number of private rooms are:', private_room_count)

The number of private rooms are: 11356

### Cleaning and finding the mean of the price column

In [11]:
# What is the average listing price?
# To convert price to numeric, remove " dollars" from each value
merged_all['price_clean'] = merged_all['price'].str.replace(' dollars', '').astype(float)
avg_price = merged_all['price_clean'].mean()
print('The average price is:', avg_price)

The average price is: 141.7779364512674

### Creating a DataFrame with the four solution values

In [12]:
### Combine the new variables into one DataFrame called review_dates with four columns in the following order:
review_dates = pd.DataFrame({
    'first_reviewed': [first_reviewed],
    'last_reviewed': [last_reviewed],
    'nb_private_rooms': [private_room_count],
    'avg_price': [round(avg_price, 2)]
})

In [13]:
display(review_dates)

  first_reviewed last_reviewed  nb_private_rooms  avg_price
0     2019-01-01    2019-07-09             11356     141.78